export const histories = {
  about: `
    名古屋在住20歳。
    はじめはゲーム作ろうとしてプログラミングを学び始める。
    現在はまわりの人の影響もあり、フロントエンド開発に興味を持ちReactを学習中。
    UnrealEngineをかわいがりたい。
    趣味はカラオケ、ダーツ、FPS。
  `,
  timeline: [
    {
      start: "2025-8",
      end: "",
      title: "100proに参加",
      content: `
      いいアイデアも思いついたし、チーム開発楽しみ。
    `
    },
    {
      start: "2025-7",
      end: "2025-7",
      title: "DMMSprintインターン参加",
      content: `
      ハンズオン形式で資料を基に開発したり演習問題を解いたりと充実した内容だった。
      後日の本社に行きOffice見学、参加者との交流、懇親会などもあり楽しかった。
    `
    },
    {
      start: "2025-7",
      end: "",
      title: "技育キャンプvol6に参加",
      content: `
      初めてハッカソンのリーダーとして参加。継続開発してます。
    `
    },
    {
      start: "2025-2",
      end: "2025-6",
      title: "coyo-te AI competition運営＆参加",
      content: `
      運営としてゲームシステム開発、参加者としてAI開発を行う。
      賞品としてもらったNFCカードを使いたい。
    `
    },
    {
      start: "2024-12",
      end: "2024-12",
      title: "C0de×Pixivハッカソンに参加",
      content: `
      チームでの開発経験を積むため、初めてのハッカソンに参加。
      時間管理や役割分担、コミュニケーションの重要性を学ぶ。
      午前6時までの限界開発を経験する。
      `
    },
    {
      start: "2024-4",
      end: "",
      title: "UnrealEngineゲーム個人開発開始",
      content: `
      UnrealEngineを使用したゲームの個人開発を開始。
      ゲーム制作の基礎を学びながら、独自のアイデアを形にすることを目指す。
      ほんとに早く完成させたい。だれかモデリングして。
      `
    }
  ]
}
